DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыКПоступлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКПоступлению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОформлениюНакладныхПоРаспоряжению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоРаспоряжению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоНакладным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоОрдерам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюОрдеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принимается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/РазмещениеПоЯчейкам/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Ссылка = Параметры.Ссылка;

	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров;
	Штрихкод = Параметры.Штрихкод;
	ПорядокСканирования = Параметры.ПорядокСканирования;
	
#Если МобильныйАвтономныйСервер Тогда
	Элементы.ФормаОтменитьЗаданиеНаРазмещение.Видимость = Ложь;
#Иначе
	Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	Если Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено И ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ОтборРазмещениеТоваров) Тогда
		Элементы.ФормаОтменитьЗаданиеНаРазмещение.Видимость = Истина;
	Иначе
		Элементы.ФормаОтменитьЗаданиеНаРазмещение.Видимость = Ложь;
	КонецЕсли;
#КонецЕсли
	
	ЗаполнитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформитьМеню("Разместить")
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
			
			ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();
			
			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда
				
				Данные = МобильноеРабочееМестоКладовщикаКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
				
				ОбработатьШтрихкод(Данные);

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиВРазделРазместить(Команда)
	ОформитьМеню("Разместить");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРазделРазмещено(Команда)
	ОформитьМеню("Размещено");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "РазмещениеВЯчейку");
	ПараметрыФормы.Вставить("НомерСтроки", ТоварыРазместить.Индекс(Элементы.ТоварыРазместить.ТекущиеДанные));
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("Ячейка", Элемент.ТекущиеДанные.Ячейка);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	
	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРазмещеноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "РедактированиеРазмещениеПоЯчейкам");
	ПараметрыФормы.Вставить("НомерСтроки", ТоварыРазмещено.Индекс(Элементы.ТоварыРазмещено.ТекущиеДанные));
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("Ячейка", Элемент.ТекущиеДанные.Ячейка);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
	
	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРазмещение(Команда)
	
	Если ТоварыРазместить.Количество() = 0 и ТоварыРазмещено.Количество() = 0 Тогда
		Состояние(НСтр("ru = 'Нет товаров для размещения'"));
		Возврат;
	КонецЕсли;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Завершить", НСтр("ru = 'Завершить'"));
	СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Завершить размещение?'"), СписокЗначений, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	ЗаполнитьЗонуПриемки();
КонецПроцедуры

&НаКлиенте
Процедура СобратьВсе(Команда)
	СобратьВсеНаСервере();
	ОформитьМеню("Размещено");
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ДокументСсылка", Ссылка);
	
	Если ПорядокСканирования = "СначалаСканированиеЯчейки" Тогда
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияЯчейки", ЭтотОбъект);
		ПараметрыФормы.Вставить("ТипПоиска", "ПоискЯчейки");
		
	Иначе
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
		ПараметрыФормы.Вставить("ТипПоиска", "ПоискНоменклатуры");
		
	КонецЕсли;
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкода",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	Иначе
		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкодаАвтономныйРежим",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОформитьМеню(ИмяВкладки)
	
	ПоказатьМеню();
	
	Элементы.РамкаРазместить.Картинка = БиблиотекаКартинок.РамкаМенюБелая;
	Элементы.КомандаРазместить.ЦветТекста = WebЦвета.ТемноСерый;
	
	Элементы.РамкаРазмещено.Картинка = БиблиотекаКартинок.РамкаМенюБелая;
	Элементы.КомандаРазмещено.ЦветТекста = WebЦвета.ТемноСерый;
	
	Если ИмяВкладки = "Разместить" Тогда
		Элементы.РамкаРазместить.Картинка = БиблиотекаКартинок.РамкаМенюЧерная;
		Элементы.КомандаРазместить.ЦветТекста = WebЦвета.Черный;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРазместить;
	ИначеЕсли ИмяВкладки = "Размещено" Тогда
		Элементы.РамкаРазмещено.Картинка = БиблиотекаКартинок.РамкаМенюЧерная; 
		Элементы.КомандаРазмещено.ЦветТекста = WebЦвета.Черный;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРазмещено;
	КонецЕсли;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиКомандМеню()
	Элементы.КомандаРазместить.Заголовок = СтрШаблон(НСтр("ru = 'Разместить (%1)'"), ТоварыРазместить.Количество());
	Элементы.КомандаРазмещено.Заголовок = СтрШаблон(НСтр("ru = 'Размещено (%1)'"), ТоварыРазмещено.Количество());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтборРазмещениеТоваров.Склад КАК Склад,
		|	ОтборРазмещениеТоваров.Комментарий КАК Комментарий,
		|	ОтборРазмещениеТоваров.Исполнитель КАК Исполнитель,
		|	ОтборРазмещениеТоваров.Помещение КАК Помещение,
		|	ОтборРазмещениеТоваров.ЗонаПриемки КАК ЗонаПриемки,
		|	ОтборРазмещениеТоваров.Номер КАК Номер,
		|	ОтборРазмещениеТоваров.Дата КАК Дата,
		|	ОтборРазмещениеТоваров.ТоварыРазмещение.(
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.Артикул КАК Артикул,
		|		Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|		Характеристика КАК Характеристика,
		|		Серия КАК Серия,
		|		Упаковка КАК Упаковка,
		|		Количество КАК Количество,
		|		КоличествоУпаковок КАК КоличествоУпаковок,
		|		КоличествоРазмещено КАК КоличествоРазмещено,
		|		КоличествоУпаковокРазмещено КАК КоличествоУпаковокРазмещено,
		|		Назначение КАК Назначение,
		|		Ячейка КАК Ячейка
		|	) КАК ТоварыРазмещение
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
		|ГДЕ
		|	ОтборРазмещениеТоваров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	
	Для Каждого Строка Из ВыборкаДетальныеЗаписи.ТоварыРазмещение.Выгрузить() Цикл
		
		Разместить         = Строка.Количество - Строка.КоличествоРазмещено;
		РазместитьУпаковок = Строка.КоличествоУпаковок - Строка.КоличествоУпаковокРазмещено;
		
		Если Строка.КоличествоРазмещено > 0 Тогда
			НоваяСтрока = ТоварыРазмещено.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Количество = Строка.КоличествоРазмещено;
			НоваяСтрока.КоличествоУпаковок = Строка.КоличествоУпаковокРазмещено;
		ИначеЕсли Разместить > 0 Тогда
			НоваяСтрока = ТоварыРазместить.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Упаковка) Тогда
				НоваяСтрока.Упаковка = Строка.НоменклатураЕдиницаИзмерения;
			КонецЕсли;
			НоваяСтрока.Количество = Разместить;
			НоваяСтрока.КоличествоУпаковок = РазместитьУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьФормуНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере(Результат)
	
	Литерал = "НомерСтроки";
	НомерСтроки = Результат[Литерал];
	
	КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Результат.Упаковка, Результат.Номенклатура);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
	СтруктураПоиска.Вставить("Серия", Результат.Серия);
	СтруктураПоиска.Вставить("Упаковка", Результат.Упаковка);
	СтруктураПоиска.Вставить("Назначение", Результат.Назначение); 
	СтруктураПоиска.Вставить("Ячейка", Результат.Ячейка);
	
	Если Результат.Режим = "РедактированиеРазмещениеПоЯчейкам" Тогда
		
		ИсходноеКоличество = ТоварыРазмещено[Результат.НомерСтроки].КоличествоУпаковок;
		
		ТоварыРазмещено[Результат.НомерСтроки].Упаковка           = Результат.Упаковка;
		ТоварыРазмещено[Результат.НомерСтроки].КоличествоУпаковок = Результат.КоличествоУпаковок;
		ТоварыРазмещено[Результат.НомерСтроки].Количество         = ТоварыРазмещено[Результат.НомерСтроки].КоличествоУпаковок * КоэффициентУпаковки;
		ТоварыРазмещено[Результат.НомерСтроки].Серия              = Результат.Серия;
		ТоварыРазмещено[Результат.НомерСтроки].Назначение         = Результат.Назначение;
		
		РезультатПоиска = ТоварыРазместить.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок +  ИсходноеКоличество - Результат.КоличествоУпаковок;
			РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
		ИначеЕсли ИсходноеКоличество - Результат.КоличествоУпаковок > 0 Тогда
			НоваяСтрока = ТоварыРазместить.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			НоваяСтрока.КоличествоУпаковок = ИсходноеКоличество - Результат.КоличествоУпаковок;
			НоваяСтрока.Количество         = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		КонецЕсли;
		
	Иначе
		
		ТоварыРазместить[НомерСтроки].Количество = ТоварыРазместить[НомерСтроки].Количество - Результат.КоличествоУпаковок * КоэффициентУпаковки;
		КоэффициентУпаковкиРазместить = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(ТоварыРазместить[НомерСтроки].Упаковка, ТоварыРазместить[НомерСтроки].Номенклатура);
		ТоварыРазместить[НомерСтроки].КоличествоУпаковок = ТоварыРазместить[НомерСтроки].Количество / КоэффициентУпаковкиРазместить;
		
		Если ТоварыРазместить[НомерСтроки].КоличествоУпаковок <= 0 Тогда
			ТоварыРазместить.Удалить(НомерСтроки);
		КонецЕсли; 
		
		РезультатПоиска = ТоварыРазмещено.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + Результат.КоличествоУпаковок;
			РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
		ИначеЕсли Результат.КоличествоУпаковок > 0 Тогда
			НоваяСтрока = ТоварыРазмещено.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		КонецЕсли;
		
	КонецЕсли;
	
	Сч = 0;
	Пока Сч < ТоварыРазместить.Количество() Цикл
		Если ТоварыРазместить[Сч].Количество <= 0 Тогда
			ТоварыРазместить.Удалить(Сч);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	Сч = 0;
	Пока Сч < ТоварыРазмещено.Количество() Цикл
		Если ТоварыРазмещено[Сч].Количество <= 0 Тогда
			ТоварыРазмещено.Удалить(Сч);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ДанныеШтрихкода)
		
	ШтрихкодыВалидны = МобильноеРабочееМестоКладовщикаКлиент.ШтрихкодыВалидны(ДанныеШтрихкода); 
	
	Если Не ШтрихкодыВалидны Тогда
		Возврат;
	КонецЕсли;
		
	Если Штрихкод = ДанныеШтрихкода.Штрихкод Тогда  
		
		Если  ТоварыРазместить.Количество() = 0 и ТоварыРазмещено.Количество() = 0 Тогда
			ТекстОшибки = НСтр("ru = 'Нет товаров для размещения'");
			Состояние(ТекстОшибки);
			Возврат;
		КонецЕсли;
				
		РазмещениеЗавершено = ЗакончитьРазмещениеНаСервере();
		
		Если РазмещениеЗавершено Тогда
			Закрыть();
		Иначе
			Состояние(ТекстОшибки);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СначалаПоискЯчейки = (ПорядокСканирования = "СначалаСканированиеЯчейки");

	Если СначалаПоискЯчейки Тогда
		
		ДанныеЯчейки = ДанныеЯчейкиПоШК(ДанныеШтрихкода.Штрихкод); 
		
		Если ЗначениеЗаполнено(ДанныеЯчейки.Ячейка) Тогда
			РезультатСканированияЯчейки(ДанныеЯчейки);
			Возврат;
		КонецЕсли;
				
		Состояние(НСтр("ru = 'Ячейка по штрихкоду не найдена'"));
	Иначе
		
		ДанныеТоваров = ДанныеТоваровПоШК(ДанныеШтрихкода.Штрихкод); 
		
		Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
			РезультатСканированияТовара(ДанныеТоваров);
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Номенклатура по штрихкоду не найдена'"));
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура РезультатСканированияЯчейки(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = Новый ОписаниеОповещения("ЗавершитьРазмещениеВЯчейку", ЭтотОбъект);
	
	ТоварыВЯчейке = Новый Массив;
	
	Для Каждого Строка Из ТоварыРазместить Цикл
		
		Если Строка.Ячейка = Результат.Ячейка Тогда
			
			Структура = СтруктураТоваров();
			ЗаполнитьЗначенияСвойств(Структура, Строка);
			
			ТоварыВЯчейке.Добавить(Структура);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ячейка",      Результат.Ячейка);
	ПараметрыФормы.Вставить("Товары",      ТоварыВЯчейке);
	ПараметрыФормы.Вставить("Склад",       Склад); 
	ПараметрыФормы.Вставить("Помещение",   Помещение);
	ПараметрыФормы.Вставить("ТипОперации", 1);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
	ПараметрыФормы.Вставить("ШтрихкодЯчейки", Результат.Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
	ПараметрыФормы.Вставить("Ссылка", Ссылка);
	
	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.РазмещениеВЯчейки",ПараметрыФормы,
	ЭтотОбъект,,,,Описание,
	РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатСканированияТовара(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() > 1 Тогда 
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
		
		ЗначенияЗаполнения = Новый Структура;		
		ЗначенияЗаполнения.Вставить("Товары", Результат);
		ЗначенияЗаполнения.Вставить("Режим", "ВыборНоменклатуры");
		ЗначенияЗаполнения.Вставить("Штрихкод", "");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РезультатСканирования", ЗначенияЗаполнения);
		
		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.ФормаВыбораСканирование", ПараметрыФормы,
			ЭтотОбъект,,,,Описание, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		ДанныеТовара = Результат[0]; 
		
		Описание = Новый ОписаниеОповещения("ДобавитьТовар", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура", ДанныеТовара.Номенклатура);
		ПараметрыФормы.Вставить("Характеристика", ДанныеТовара.Характеристика);
		ПараметрыФормы.Вставить("Серия", ДанныеТовара.Серия);
		ПараметрыФормы.Вставить("Упаковка", ДанныеТовара.Упаковка);
		ПараметрыФормы.Вставить("Количество", ДанныеТовара.Количество);
		ПараметрыФормы.Вставить("Режим", "РазмещениеВЯчейку");
		ПараметрыФормы.Вставить("НомерСтроки", 0);
		ПараметрыФормы.Вставить("Склад", Склад);
		ПараметрыФормы.Вставить("Помещение", Помещение);
		ПараметрыФормы.Вставить("ШтрихкодУпаковки", ДанныеТовара.ШтрихкодУпаковки);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Источник", Ссылка);
		ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
		
		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРазмещениеВЯчейку(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьРазмещениеВЯчейкуНаСервере(Результат);
	Если ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		РезультатСканированияЯчейки(Результат.ДанныеСледующейЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьРазмещениеВЯчейкуНаСервере(Результат)
	
	ТекстОперации = НСтр("ru = 'Не требуется размещение номенклатуры %1 в упаковке %2 в ячейку %3.'");
	
	ТаблицаТовары = ТоварыРазместить.Выгрузить();
	
	МассивРазмещений = Результат.МассивРазмещений;
	Ячейка = Результат.Ячейка;
	
	// Массив структур
	Для Каждого Строка Из МассивРазмещений Цикл
		
		Если Строка.КоличествоУпаковок <= 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Строка.Упаковка, Строка.Номенклатура);
				
		ОтборПоиска = Новый Структура;
		ОтборПоиска.Вставить("Номенклатура",   Строка.Номенклатура);
		ОтборПоиска.Вставить("Характеристика", Строка.Характеристика);
		ОтборПоиска.Вставить("Серия",          Строка.Серия);
		ОтборПоиска.Вставить("Упаковка",       Строка.Упаковка);
		ОтборПоиска.Вставить("Ячейка",         Ячейка);
		
		МассивРазместить = ТаблицаТовары.НайтиСтроки(ОтборПоиска);
		Если Не МассивРазместить.Количество() И ПорядокСканирования = "СначалаСканированиеТовара" Тогда
			ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + СтрШаблон(ТекстОперации, 
				Строка.Номенклатура, Строка.Упаковка, Ячейка);
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТоварыРазмещено.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		
		Если ЗначениеЗаполнено(Строка.ЯчейкаЗамена) Тогда
			НоваяСтрока.Ячейка = Строка.ЯчейкаЗамена;
		КонецЕсли;
			
		Для Каждого СтрокаПоиск Из МассивРазместить Цикл
			СтрокаПоиск.КоличествоУпаковок = СтрокаПоиск.КоличествоУпаковок - НоваяСтрока.КоличествоУпаковок;
			СтрокаПоиск.Количество = СтрокаПоиск.КоличествоУпаковок;
		КонецЦикла;
		
	КонецЦикла;
	
	Сч = 0;
	Пока Сч < ТаблицаТовары.Количество() Цикл
		
		Если ТаблицаТовары[Сч].КоличествоУпаковок <= 0 Тогда
			ТаблицаТовары.Удалить(ТаблицаТовары[Сч]);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ТоварыРазместить.Загрузить(ТаблицаТовары);
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТекстОшибки = "";
	ДобавитьТоварНаСервере(Результат);
	
	Если Результат = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		Состояние(ТекстОшибки); 
	КонецЕсли;

	Если ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		РезультатСканированияТовара(Результат.ДанныеСледующегоТовара);
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьТоварНаСервере(Знач Результат)
	
	СтруктураПоиска = Новый Структура;
	
	Если Результат = Неопределено Тогда
		
		СтруктураПоиска.Вставить("Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());		
		РезультатПоиска = ТоварыРазмещено.НайтиСтроки(СтруктураПоиска);
		Для Каждого Строка Из РезультатПоиска Цикл
			ТоварыРазмещено.Удалить(Строка);
		КонецЦикла;
		
		Возврат;
	КонецЕсли; 
		
	Если Не ЗначениеЗаполнено(Результат.Ячейка) И Не ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		НоваяСтрока = ТоварыРазмещено.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат); 
		Возврат;
	КонецЕсли;
	
	МассивРазмещений = Новый Массив; 
	
	Если ЗначениеЗаполнено(Результат.Ячейка) Тогда
		Ячейка = Результат.Ячейка;
	ИначеЕсли ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		Ячейка = Результат.ДанныеСледующейЯчейки.Ячейка;
	КонецЕсли; 

	Структура = СтруктураТоваровРазмещения();
	ЗаполнитьЗначенияСвойств(Структура, Результат);
	Структура.Ячейка = Ячейка;
	МассивРазмещений.Добавить(Структура);
	
	Если Не ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		СтруктураПоиска.Вставить("Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());
		РезультатПоиска = ТоварыРазмещено.НайтиСтроки(СтруктураПоиска);
			
		Для Каждого Строка Из РезультатПоиска Цикл
			Структура = СтруктураТоваровРазмещения();
			Строка.Ячейка = Ячейка;
			ЗаполнитьЗначенияСвойств(Структура, Строка); 
			МассивРазмещений.Добавить(Структура);
		КонецЦикла;
			
		Для Каждого Строка Из РезультатПоиска Цикл
			ТоварыРазмещено.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
		 
	Результат.Вставить("МассивРазмещений", МассивРазмещений);
	Результат.Вставить("Ячейка", Ячейка); 
	ЗавершитьРазмещениеВЯчейкуНаСервере(Результат);
		
КонецПроцедуры

&НаСервере
Функция ЗакончитьРазмещениеНаСервере()
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	ДокументОбъект.Помещение   = Помещение;
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ЗонаПриемки = ЗонаПриемки;
	ДокументОбъект.Исполнитель = Исполнитель;
	
	ДокументОбъект.ТоварыРазмещение.Очистить();
	
	Если МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Склад, "ИспользоватьСкладскиеПомещения")
		И Помещение.Пустая() Тогда
		
		ТекстОшибки = НСтр("ru = 'Не выбрано помещение'");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗонаПриемки.Пустая() Тогда
				
		ТекстОшибки = НСтр("ru = 'Не выбрана зона приемки'");
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		Возврат Ложь;
		
	КонецЕсли;
	
	Для Каждого Строка Из ТоварыРазмещено Цикл
		
		НоваяСтрока = ДокументОбъект.ТоварыРазмещение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КоличествоРазмещено = Строка.Количество;
		НоваяСтрока.КоличествоУпаковокРазмещено = Строка.КоличествоУпаковок;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоУпаковок;
		
	КонецЦикла;
	
	Для Каждого Строка Из ТоварыРазместить Цикл
		
		НоваяСтрока = ДокументОбъект.ТоварыРазмещение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.КоличествоУпаковок = Строка.КоличествоУпаковок;
		
	КонецЦикла;
	
	ПараметрыУказанияСерий = Документы.ОтборРазмещениеТоваров.ПараметрыУказанияСерий(ДокументОбъект);
	МобильноеРабочееМестоКладовщика.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий.Размещение);
	
	Если ТоварыРазместить.Количество() = 0 Тогда
		ДокументОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
	ИначеЕсли ТоварыРазмещено.Количество() = 0 Тогда
		ДокументОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено;
	Иначе
		ДокументОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоСОшибками;
	КонецЕсли;
		
	Попытка
#Если НЕ МобильныйАвтономныйСервер Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
#Иначе
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
#КонецЕсли
	Исключение
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Информация(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
	СкрытьМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ОформитьМеню("Размещено");
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьЗонуПриемки()
	
	ЗонаПриемки = МобильноеРабочееМестоКладовщика.ЗонаПриемкиПоУмолчанию(Склад, Помещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМеню()

	Элементы.ГруппаМеню.Видимость = Истина;
	Элементы.ГруппаКоманды.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьМеню()

	Элементы.ГруппаМеню.Видимость = Ложь;
	Элементы.ГруппаКоманды.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СобратьВсеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
		|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
		|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КоличествоУпаковок,
		|	ТоварыКПоступлениюОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления = &ДокументПоступления) КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0";
	
	Запрос.УстановитьПараметр("ДокументПоступления", РаспоряжениеНаПоступление);
	
	Остатки = Запрос.Выполнить().Выгрузить();
	ТоварыРазмещено.Загрузить(Остатки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРазмещение(Команда)
	
	ИндексСтроки = ТоварыРазмещено.Индекс(Элементы.ТоварыРазмещено.ТекущиеДанные);
	
	Если ИндексСтроки < 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоэффициентУпаковки = ПолучитьКоэффициентУпаковкиСервер(ТоварыРазмещено[ИндексСтроки].Номенклатура, ТоварыРазмещено[ИндексСтроки].Упаковка);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",   ТоварыРазмещено[ИндексСтроки].Номенклатура);
	СтруктураПоиска.Вставить("Характеристика", ТоварыРазмещено[ИндексСтроки].Характеристика);
	СтруктураПоиска.Вставить("Серия",          ТоварыРазмещено[ИндексСтроки].Серия);
	СтруктураПоиска.Вставить("Упаковка",       ТоварыРазмещено[ИндексСтроки].Упаковка);
	СтруктураПоиска.Вставить("Ячейка",         ТоварыРазмещено[ИндексСтроки].Ячейка);
	СтруктураПоиска.Вставить("Назначение",     ТоварыРазмещено[ИндексСтроки].Назначение);
	
	РезультатПоиска = ТоварыРазместить.НайтиСтроки(СтруктураПоиска);
	Если РезультатПоиска.Количество() > 0 Тогда
		РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + ТоварыРазмещено[ИндексСтроки].КоличествоУпаковок;
		РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
	Иначе
		НоваяСтрока = ТоварыРазместить.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварыРазмещено[ИндексСтроки]);
		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
	КонецЕсли;
	
	ТоварыРазмещено.Удалить(ИндексСтроки);
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоэффициентУпаковкиСервер(Номенклатура, Упаковка)
	
	Возврат МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Упаковка, Номенклатура);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = "Завершить" Тогда
		
		РазмещениеЗавершено = ЗакончитьРазмещениеНаСервере();
		
		Если РазмещениеЗавершено Тогда
			Закрыть();
		Иначе
			Состояние(ТекстОшибки);
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеЯчейкиПоШК(Знач Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеЯчейкиПоШК(Склад, Помещение, Штрихкод);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеТоваровПоШК(Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеТоваровПоШК(Штрихкод); 
	
КонецФункции

&НаКлиенте
Процедура ОтменитьЗаданиеНаРазмещение(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Завершить", НСтр("ru = 'Пометить документ на удаление'"));
	СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить размещение'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОтменитьЗаданиеНаРазмещение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Для отмены размещения необходимо пометить на удаление документ размещения. Вернуться к редактированию будет невозможно. Пометить на удаление?'"), СписокЗначений, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОтменитьЗаданиеНаРазмещение(Результат, Параметры) Экспорт
	
	Если Результат = "Завершить" Тогда
		
		РазмещениеОтменено = ОтменитьЗаданиеНаРазмещениеНаСервере();
		
		Если РазмещениеОтменено Тогда
			Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
				Закрыть();
			КонецЕсли;
			Закрыть();
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьЗаданиеНаРазмещениеНаСервере()
	
#Если МобильныйАвтономныйСервер Тогда
	Возврат Ложь;
#Иначе
	Попытка
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		
		ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось отменить задание на размещение.'"));
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
#КонецЕсли
		
КонецФункции

&НаСервере
Функция СтруктураТоваровРазмещения()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура","");
	Структура.Вставить("Характеристика","");
	Структура.Вставить("Серия","");
	Структура.Вставить("Назначение","");
	Структура.Вставить("Упаковка","");
	Структура.Вставить("УпаковкаРазмещено","");
	Структура.Вставить("КоличествоУпаковок","");
	Структура.Вставить("КоличествоУпаковокРазмещено","");
	Структура.Вставить("Ячейка","");
	Структура.Вставить("ЯчейкаЗамена","");
	Структура.Вставить("НомерСтроки","");
	
	Возврат Структура;
	
КонецФункции 

&НаКлиенте
Функция СтруктураТоваров()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура","");
	Структура.Вставить("Характеристика","");
	Структура.Вставить("Серия","");
	Структура.Вставить("Упаковка","");
	Структура.Вставить("КоличествоУпаковок","");
	Структура.Вставить("Назначение","");
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти
